public/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 15 Mar. 2021 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Iris Yuping Ren">

<link rel="stylesheet" href="css/site.css?v=e2662350032b1b21198b0c9e501cfa8ae5cf8abffbd7896861632a463be5006f" type="text/css">
</head>
<body>
<header id="preamble" class="status">

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/semantic-ui/2.2.7/semantic.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.2/css/all.min.css">
<script src="https://cdnjs.cloudflare.com/ajax/libs/semantic-ui/2.2.7/semantic.js"></script>
<link rel="stylesheet"  href="./css/site.css"  />


<!-- <div class="ui fixed inverted menu">
     <div class="ui container">
     <a href="#" class="header item">
     Welcome
     </a>
     <a href="./index.html" class="item"><i class="home icon"></i>Home</a>
     <a href="#" class="item"><i class="mail icon"></i>Contact</a>
     <div class="ui simple dropdown item">
     CV <i class="dropdown icon"></i>
     <div class="menu">
     <a class="item" href="./music.html">Education</a>
     <a class="item" href="#">Skills</a>
     <a class="item" href="#">Awards</a>
     <a class="item" href="#">Experience</a>
     <div class="item">
     <i class="dropdown icon"></i>
     Teaching
     <div class="menu">
     <a class="item" href="#">Supervision</a>
     <a class="item" href="#">Courses</a>
     </div>
     </div>
     <a class="item" href="#">Public Profile</a>
     </div>
     </div>
     <div class="ui simple dropdown item">
     Projects <i class="dropdown icon"></i>
     <div class="menu">
     <a class="item" href="#">Musical Pattern Discovery</a>
     <a class="item" href="#">Ambiguity and Subjectivity</a>
     <a class="item" href="#">Algorithm and Data Analysis</a>
     </div>
     </div>
     <a href="./music.html" class="item"></i>Music</a>
     <a href="./posts/archive.html" class="item"></i>Blog</a>
     <a href="#" class="item"></i>Links</a>
     <div class="right menu">

     <div class="item">
     <a class="ui basic blue button" href="#">Photos</a>
     </div>

     <div class="item">
     <a class="ui basic green button" href="#">Videos</a>
     </div>
     </div>
     </div>
     </div> -->


  <!-- <div class="divider"></div> -->
  
  <!-- <div class="header">Public Profile</div> -->
</header>
<main id="content">
  <h1>Welcome to my research website!</h1>
  <h2>I'm <a href="https://irisryp.me"> Iris Yuping Ren</a></h2>
  <br>
  <div id="bio">
    <small><p> I am a PhD candidate at the Utrecht University.
My background: maths, physics, stats (BSc), complex system science (MSc), electrical and computer engineering (MSc), and cultural industry management (BMS).
I’m interested in Music Information Retrieval (MIR), Functional Programming, Machine Learning and Artificial Intelligence. </p></small>
  </div>
  <br>
  <div id="social">
    Follow me:
    <div id="stalker">
      <a title="Iris Yuping Ren on Google scholar" href="https://scholar.google.nl/citations?user=SfHtFSQAAAAJ&hl=en">
        <i class="fab fa-google"></i>
      </a>
      <a title="Iris Yuping Ren on Github" href="https://github.com/irisyupingren">
        <i class="fab fa-github-square"></i>
      </a>
      <a title="Iris Yuping Ren on Twitter" href="https://twitter.com/irisyupingren">
        <i class="fab fa-twitter-square"></i>
      </a>
    </div>
  </div>
  <br>
<section id="outline-container-orgda97ebe" class="outline-2 post-list">
<h2 id="orgda97ebe"><i aria-hidden='true' class='fa fa-newspaper'></i> News</h2>
<div class="outline-text-2" id="text-orgda97ebe">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">15 Mar 2021</span></span> Starting to make this new research website and retiring wordpress and googlesite.</li>
</ul>
</div>
</section>

<section id="outline-container-orgf5d53b5" class="outline-2 post-list">
<h2 id="orgf5d53b5"><i aria-hidden='true' class='fa fa-bookmark'></i> Latest writings</h2>
<div class="outline-text-2" id="text-orgf5d53b5">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">03 Sep 2019</span></span>  <a href="posts/2018-08-10-fma-aawm-icmpc-escom/index.html">FMA/AAWM and ICMPC/ESCOM</a></li>
</ul>

<p>
Full list at my <a href="./posts/archive.html">my Blog.</a>
</p>

<hr>
</div>
</section>

<section id="outline-container-org5297403" class="outline-2">
<h2 id="org5297403"><i aria-hidden='true' class='fa fa-graduation-cap'></i> Publications</h2>
<div class="outline-text-2" id="text-org5297403">
<ul class="org-ul">
<li>Ren, Iris, et al. &ldquo;A Computational Evaluation of Musical Pattern Discovery Algorithms.&rdquo; arXiv preprint arXiv:2010.12325 (2020).</li>
<li>Berit Jassen, Tom Collins, and Iris Yuping Ren, &ldquo;Algorithmic ability to predict the musical future: Datasets and evaluation&rdquo;. In Proceedings of the 20th International Society for Music Information Retrieval, Delft, the Netherlands, 2019.</li>
<li>Orestis Melkonian, Iris Yuping Ren, Wouter Swierstra, and Anja Volk. &ldquo;What constitutes a musical pattern?&rdquo;. In Proceedings of the 7th ACM SIGPLAN International Workshop on Functional Art, Music, Modeling, and Design (FARM 2019). ACM, New York, NY, USA, p. 95-105, 2019. DOI: <a href="https://doi.org/10.1145/3331543.3342587">https://doi.org/10.1145/3331543.3342587</a></li>
<li>Analysis by Classification: A Comparative Study of Annotated and Algorithmically Extracted Patterns in Symbolic Music Data. IY Ren, A Volk, W Swierstra, R Veltkamp. International Society of Music Information Retrieval, Paris, France, 2018.</li>
<li>Feature Analysis of Repeated Patterns in Dutch Folk Songs using Principal Component Analysis.  IY Ren, HV Koops, D Bountouridis, A Volk, W Swierstra, R Veltkamp. Folk Music Analysis, Thessaloniki, Greece, 2018.</li>
<li>Investigating Musical Pattern Ambiguity in a Human Annotated Dataset, IY Ren, O Nieto, HV Koops, A Volk, W Swierstra. International Conference on Music Perception and Cognition/European Society for the Cognitive Sciences of Music. Graz, Germany, 2018.</li>
<li>In Search of the Consensus among Musical Pattern Discovery Algorithms. IY Ren, HV Koops, A Volk, W Swierstra. International Society of Music Information Retrieval, Suzhou, China, 2017.</li>
<li>Mediant Mixture and “Blue Notes” in Rock: An Exploratory Study. D Temperley, IY Ren, Z Duan. Music Theory Online, 2016.</li>
<li>Using Scale-Free Closed Patterns to Discover Repeated Themes and Sections in Monophonic Music. IY Ren, Z Duan. Music Information Retrieval Evaluation Exchange, New York City, USA, 2016.</li>
<li>“Blue Notes” in Rock: An Exploratory Study. IY Ren, D Temperley, Z Duan. Cognitively Based Music Informatics Research, New York City, USA, 2016.</li>
<li>Closed patterns in folk music and other genres. IY Ren. Proceedings of the 6th International Workshop on Folk Music Analysis. Dublin, Ireland. 2016.</li>
<li>Exploring the Rules in Species Counterpoint. IY Ren. Conference on Computer Simulation of Musical Creativity, Huddersfield, UK, 2016.</li>
<li>Synchronisation in Music Group Playing. IY Ren, R Doursat, JL Giavitto. International Symposium on Computer Music Multidisciplinary Research, Plymouth, UK, 2015.</li>
<li>Complexity of Music Pattern. IY Ren, C Genio. Student Conference on Complexity Science, Singapore, 2014.</li>
<li>Properly coloured paths and cycles in edge coloured graphs. Baoyang Song, Xiaozong Wang, IY Ren. Journal of Shandong University, 2012.</li>
</ul>
</div>
</section>


<section id="outline-container-org6d72812" class="outline-2">
<h2 id="org6d72812">Presentations</h2>
<div class="outline-text-2" id="text-org6d72812">
<ul class="org-ul">
<li><a href="https://irisyupingren.github.io/presentations/org/FARM2019#/sec-title-slide">FARM2019</a></li>
<li><a href="https://docs.google.com/presentation/d/1CFfumEuk8m1f8cWa9uMNgL8vHiAdze4ZkGLqu5ZWQSU/edit?usp=sharing">NWD2019</a></li>
<li><a href="https://docs.google.com/presentation/d/1EyAM6mTq9fKZds4AhveZlm5k_zQz2TxA7eHbZADyzsU/edit?usp=sharing">SMT2020-2021</a></li>
</ul>
</div>
</section>
</main>
<footer id="postamble" class="status">

<p class='disclaimer'>The content on this website are my own and do not necessarily represent my employer’s positions, strategies, or opinions.</p>

<p>Last updated 15 Mar. 2021. Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.4.4). <a href="/README.html">Details</a>.</p>
</footer>
</body>
</html>
